In [3]:
import pandas as pd

In [5]:
tech = pd.read_csv('./data/tech_giants.csv')
tech.head()

,date,month,year,day,name,open,close,high,low,volume,volume_type
0,2014-01-02,1,2014,2,FB,54.86,54.71,55.22,54.19,43257622,medium
1,2014-01-02,1,2014,2,AAPL,79.38,79.02,79.58,78.86,8398851,low
2,2014-01-02,1,2014,2,GOOGL,557.73,556.56,558.88,554.13,1822719,medium
3,2014-01-02,1,2014,2,MSFT,37.35,37.16,37.40,37.10,30643745,medium
4,2014-01-02,1,2014,2,AMZN,398.80,397.97,399.36,394.02,2140246,medium

In [7]:
tech.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7105 entries, 0 to 7104
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         7105 non-null   object
 1   month        7105 non-null   int64
 2   year         7105 non-null   int64
 3   day          7105 non-null   int64
 4   name         7105 non-null   object
 5   open         7105 non-null   float64
 6   close        7105 non-null   float64
 7   high         7105 non-null   float64
 8   low          7105 non-null   float64
 9   volume       7105 non-null   int64
 10  volume_type  7105 non-null   object
dtypes: float64(4), int64(4), object(3)
memory usage: 610.7+ KB

In [8]:
type(tech.index)

pandas.core.indexes.range.RangeIndex

In [9]:
type(tech.columns)

pandas.core.indexes.base.Index

In [10]:
tech.set_index('date')

,month,year,day,name,open,close,high,low,volume,volume_type
date,,,,,,,,,,
2014-01-02,1,2014,2,FB,54.86,54.71,55.22,54.19,43257622,medium
2014-01-02,1,2014,2,AAPL,79.38,79.02,79.58,78.86,8398851,low
2014-01-02,1,2014,2,GOOGL,557.73,556.56,558.88,554.13,1822719,medium
2014-01-02,1,2014,2,MSFT,37.35,37.16,37.40,37.10,30643745,medium
2014-01-02,1,2014,2,AMZN,398.80,397.97,399.36,394.02,2140246,medium
...,...,...,...,...,...,...,...,...,...,...
2019-08-23,8,2019,23,MSFT,137.19,133.39,138.35,132.80,38515386,medium
2019-08-23,8,2019,23,AAPL,209.43,202.64,212.05,201.00,46882843,medium
2019-08-23,8,2019,23,GOOGL,1185.17,1153.58,1195.67,1150.00,1813141,medium
2019-08-23,8,2019,23,AMZN,1793.03,1749.62,1804.90,1745.23,5277898,medium
2019-08-23,8,2019,23,FB,180.84,177.75,183.13,176.66,17331221,medium

In [12]:
tech.set_index('date').loc['2019-08-01']

,month,year,day,name,open,close,high,low,volume,volume_type
date,,,,,,,,,,
2019-08-01,8,2019,1,GOOGL,1217.63,1211.78,1236.30,1207.00,1771271,medium
2019-08-01,8,2019,1,FB,194.17,192.73,198.47,190.88,17777013,medium
2019-08-01,8,2019,1,MSFT,137.00,138.06,140.94,136.93,40557502,medium
2019-08-01,8,2019,1,AMZN,1871.72,1855.32,1897.92,1844.01,4713311,medium
2019-08-01,8,2019,1,AAPL,213.90,208.43,218.03,206.74,54017922,medium

In [15]:
# Create multi-index
tech.set_index(['date','name'], inplace=True)

,,month,year,day,open,close,high,low,volume,volume_type
name,date,,,,,,,,,
FB,2014-01-02,1,2014,2,54.86,54.71,55.22,54.19,43257622,medium
AAPL,2014-01-02,1,2014,2,79.38,79.02,79.58,78.86,8398851,low
GOOGL,2014-01-02,1,2014,2,557.73,556.56,558.88,554.13,1822719,medium
MSFT,2014-01-02,1,2014,2,37.35,37.16,37.40,37.10,30643745,medium
AMZN,2014-01-02,1,2014,2,398.80,397.97,399.36,394.02,2140246,medium
...,...,...,...,...,...,...,...,...,...,...
MSFT,2019-08-23,8,2019,23,137.19,133.39,138.35,132.80,38515386,medium
AAPL,2019-08-23,8,2019,23,209.43,202.64,212.05,201.00,46882843,medium
GOOGL,2019-08-23,8,2019,23,1185.17,1153.58,1195.67,1150.00,1813141,medium
AMZN,2019-08-23,8,2019,23,1793.03,1749.62,1804.90,1745.23,5277898,medium
FB,2019-08-23,8,2019,23,180.84,177.75,183.13,176.66,17331221,medium

In [16]:
tech.head(10)

                  month  year  day    open   close    high     low    volume  \
date       name
2014-01-02 FB         1  2014    2   54.86   54.71   55.22   54.19  43257622
           AAPL       1  2014    2   79.38   79.02   79.58   78.86   8398851
           GOOGL      1  2014    2  557.73  556.56  558.88  554.13   1822719
           MSFT       1  2014    2   37.35   37.16   37.40   37.10  30643745
           AMZN       1  2014    2  398.80  397.97  399.36  394.02   2140246
2014-01-03 FB         1  2014    3   55.00   54.56   55.65   54.53  38287706
           GOOGL      1  2014    3  557.50  552.50  558.47  552.47   1669229
           MSFT       1  2014    3   37.20   36.91   37.22   36.60  31134795
           AAPL       1  2014    3   79.00   77.28   79.10   77.20  14043410
           AMZN       1  2014    3  398.29  396.44  402.71  396.22   2213512

                 volume_type
date       name
2014-01-02 FB         medium
           AAPL          low
           GOOGL      medium
           MSFT       medium
           AMZN       medium
2014-01-03 FB         medium
           GOOGL      medium
           MSFT       medium
           AAPL          low
           AMZN       medium

In [17]:
type(tech.index)

pandas.core.indexes.multi.MultiIndex

In [18]:
tech_1 = pd.read_csv('./data/tech_giants.csv', index_col=['date', 'name'])
tech_1

                  month  year  day     open    close     high      low  \
date       name
2014-01-02 FB         1  2014    2    54.86    54.71    55.22    54.19
           AAPL       1  2014    2    79.38    79.02    79.58    78.86
           GOOGL      1  2014    2   557.73   556.56   558.88   554.13
           MSFT       1  2014    2    37.35    37.16    37.40    37.10
           AMZN       1  2014    2   398.80   397.97   399.36   394.02
...                 ...   ...  ...      ...      ...      ...      ...
2019-08-23 MSFT       8  2019   23   137.19   133.39   138.35   132.80
           AAPL       8  2019   23   209.43   202.64   212.05   201.00
           GOOGL      8  2019   23  1185.17  1153.58  1195.67  1150.00
           AMZN       8  2019   23  1793.03  1749.62  1804.90  1745.23
           FB         8  2019   23   180.84   177.75   183.13   176.66

                    volume volume_type
date       name
2014-01-02 FB     43257622      medium
           AAPL    8398851         low
           GOOGL   1822719      medium
           MSFT   30643745      medium
           AMZN    2140246      medium
...                    ...         ...
2019-08-23 MSFT   38515386      medium
           AAPL   46882843      medium
           GOOGL   1813141      medium
           AMZN    5277898      medium
           FB     17331221      medium

[7105 rows x 9 columns]

In [20]:
tech.loc['2014-01-02']

       month  year  day    open   close    high     low    volume volume_type
name
FB         1  2014    2   54.86   54.71   55.22   54.19  43257622      medium
AAPL       1  2014    2   79.38   79.02   79.58   78.86   8398851         low
GOOGL      1  2014    2  557.73  556.56  558.88  554.13   1822719      medium
MSFT       1  2014    2   37.35   37.16   37.40   37.10  30643745      medium
AMZN       1  2014    2  398.80  397.97  399.36  394.02   2140246      medium

In [ ]:
tech.loc['2014-01-02','GOOGL'] # or
tech.loc[('2014-01-02','GOOGL')]

month                1
year              2014
day                  2
open            557.73
close           556.56
high            558.88
low             554.13
volume         1822719
volume_type     medium
Name: (2014-01-02, GOOGL), dtype: object

In [23]:
tech.loc[('2014-01-02','GOOGL'), 'close']

np.float64(556.56)

In [24]:
# Label-based approach
tech.loc[('2014-01-03','AAPL'), 'open':'close']

open     79.00
close    77.28
Name: (2014-01-03, AAPL), dtype: float64

In [25]:
# Position-based approach
tech.iloc[8,3:5]

open     79.00
close    77.28
Name: (2014-01-03, AAPL), dtype: float64

In [26]:
# Select multiple days
tech.loc[['2015-01-06','2015-01-07']]

                  month  year  day    open   close    high     low    volume  \
date       name
2015-01-06 AAPL       1  2015    6  106.54  106.26  107.43  104.63  65797116
           FB         1  2015    6   77.23   76.15   77.59   75.36  27399288
           AMZN       1  2015    6  302.20  295.29  303.00  292.38   3519034
           MSFT       1  2015    6   46.38   45.65   46.75   45.54  36447854
           GOOGL      1  2015    6  520.49  506.64  521.21  505.55   2731813
2015-01-07 FB         1  2015    7   76.76   76.15   77.36   75.82  22045333
           MSFT       1  2015    7   45.98   46.23   46.46   45.49  29114061
           GOOGL      1  2015    7  510.99  505.15  511.49  503.65   2345875
           AMZN       1  2015    7  297.54  298.42  301.28  295.33   2640349
           AAPL       1  2015    7  107.20  107.75  108.20  106.70  40105934

                 volume_type
date       name
2015-01-06 AAPL       medium
           FB         medium
           AMZN       medium
           MSFT       medium
           GOOGL      medium
2015-01-07 FB         medium
           MSFT       medium
           GOOGL      medium
           AMZN       medium
           AAPL       medium

In [28]:
tech.loc[(['2015-01-06','2015-01-07'], ['GOOGL','AAPL']), :]

                  month  year  day    open   close    high     low    volume  \
date       name
2015-01-06 GOOGL      1  2015    6  520.49  506.64  521.21  505.55   2731813
           AAPL       1  2015    6  106.54  106.26  107.43  104.63  65797116
2015-01-07 GOOGL      1  2015    7  510.99  505.15  511.49  503.65   2345875
           AAPL       1  2015    7  107.20  107.75  108.20  106.70  40105934

                 volume_type
date       name
2015-01-06 GOOGL      medium
           AAPL       medium
2015-01-07 GOOGL      medium
           AAPL       medium

In [30]:
tech.loc[(['2015-01-06','2015-01-07'], ['GOOGL','AAPL']), ['day','low']]

                  day     low
date       name
2015-01-06 GOOGL    6  505.55
           AAPL     6  104.63
2015-01-07 GOOGL    7  503.65
           AAPL     7  106.70

In [31]:
tech.loc['2017-01-03':'2017-01-31', 'day':'low']

                  day    open   close    high     low
date       name
2017-01-03 AMZN     3  757.92  753.67  758.76  747.70
           FB       3  116.03  116.86  117.84  115.51
           MSFT     3   62.79   62.58   62.84   62.13
           AAPL     3  115.80  116.15  116.33  114.76
           GOOGL    3  800.62  808.01  811.44  796.89
...               ...     ...     ...     ...     ...
2017-01-31 MSFT    31   64.86   64.65   65.15   64.26
           AAPL    31  121.15  121.35  121.39  120.62
           FB      31  130.17  130.32  130.66  129.52
           GOOGL   31  819.50  820.19  823.07  813.40
           AMZN    31  823.75  823.48  826.99  819.56

[100 rows x 5 columns]

In [32]:
tech.loc[(slice('2017-01-03','2017-01-31'), 'GOOGL'),'day':'low']

                  day    open   close    high     low
date       name
2017-01-03 GOOGL    3  800.62  808.01  811.44  796.89
2017-01-04 GOOGL    4  809.89  807.77  813.43  804.11
2017-01-05 GOOGL    5  807.50  813.02  813.74  805.92
2017-01-06 GOOGL    6  814.99  825.21  828.96  811.50
2017-01-09 GOOGL    9  826.37  827.18  830.43  821.62
2017-01-10 GOOGL   10  827.07  826.01  829.41  823.14
2017-01-11 GOOGL   11  826.62  829.86  829.90  821.47
2017-01-12 GOOGL   12  828.38  829.53  830.38  821.01
2017-01-13 GOOGL   13  831.00  830.94  834.65  829.52
2017-01-17 GOOGL   17  830.00  827.46  830.18  823.20
2017-01-18 GOOGL   18  829.80  829.02  829.81  824.08
2017-01-19 GOOGL   19  829.00  824.37  833.00  823.96
2017-01-20 GOOGL   20  829.09  828.17  829.24  824.60
2017-01-23 GOOGL   23  831.61  844.43  845.54  828.70
2017-01-24 GOOGL   24  846.98  849.53  851.52  842.28
2017-01-25 GOOGL   25  853.55  858.45  858.79  849.74
2017-01-26 GOOGL   26  859.05  856.98  861.00  850.52
2017-01-27 GOOGL   27  859.00  845.03  867.00  841.90
2017-01-30 GOOGL   30  837.06  823.83  837.23  821.03
2017-01-31 GOOGL   31  819.50  820.19  823.07  813.40

In [34]:
tech.loc[(slice(None), ['FB','GOOGL']),'open']

date        name
2014-01-02  FB         54.86
2014-01-03  FB         55.00
2014-01-06  FB         54.39
2014-01-07  FB         57.67
2014-01-08  FB         57.59
                      ...
2019-08-19  GOOGL    1191.83
2019-08-20  GOOGL    1195.35
2019-08-21  GOOGL    1195.82
2019-08-22  GOOGL    1193.80
2019-08-23  GOOGL    1185.17
Name: open, Length: 2842, dtype: float64

In [ ]:
tech.loc[(slice(None), ['FB','AMZN']),['high','low']] #or
tech.loc[pd.IndexSlice[:,['FB','AMZN']], 'high':'low']

                    high      low
date       name
2014-01-02 FB      55.22    54.19
2014-01-03 FB      55.65    54.53
2014-01-06 FB      57.26    54.05
2014-01-07 FB      58.55    57.22
2014-01-08 FB      58.41    57.23
...                  ...      ...
2019-08-19 AMZN  1826.00  1812.61
2019-08-20 AMZN  1816.82  1799.88
2019-08-21 AMZN  1829.58  1815.00
2019-08-22 AMZN  1829.41  1800.10
2019-08-23 AMZN  1804.90  1745.23

[2842 rows x 2 columns]

In [38]:
# Exercise
tech_df2 = tech.loc['2015-07-13':'2016-08-17']
tech_df2

                  month  year  day    open   close    high     low    volume  \
date       name
2015-07-13 MSFT       7  2015   13   44.98   45.54   45.62   44.95  28178329
           AMZN       7  2015   13  448.29  455.57  457.87  447.54   3956802
           FB         7  2015   13   88.66   90.10   90.22   88.42  29976670
           GOOGL      7  2015   13  559.51  571.73  572.85  558.70   2089641
           AAPL       7  2015   13  125.03  125.66  125.76  124.32  41440538
...                 ...   ...  ...     ...     ...     ...     ...       ...
2016-08-17 GOOGL      8  2016   17  800.00  805.42  805.63  796.30   1066070
           AMZN       8  2016   17  764.41  764.63  765.22  759.20   1891116
           MSFT       8  2016   17   57.54   57.56   57.68   57.23  18856423
           FB         8  2016   17  123.66  124.37  124.38  122.85  13794179
           AAPL       8  2016   17  109.10  109.22  109.37  108.34  25355976

                 volume_type
date       name
2015-07-13 MSFT       medium
           AMZN       medium
           FB         medium
           GOOGL      medium
           AAPL       medium
...                      ...
2016-08-17 GOOGL      medium
           AMZN          low
           MSFT       medium
           FB            low
           AAPL       medium

[1395 rows x 9 columns]

In [41]:
tech_df2.loc[(slice(None),'AAPL'),:].sample(10)

,,month,year,day,open,close,high,low,volume,volume_type
date,name,,,,,,,,,
2015-08-19,AAPL,8,2015,19,116.10,115.01,116.52,114.68,48286510,medium
2015-07-13,AAPL,7,2015,13,125.03,125.66,125.76,124.32,41440538,medium
2016-02-22,AAPL,2,2016,22,96.31,96.88,96.90,95.92,34280758,medium
2016-06-06,AAPL,6,2016,6,97.99,98.63,101.89,97.55,23292504,medium
2015-09-24,AAPL,9,2015,24,113.25,115.00,115.50,112.37,50219475,medium
2015-11-17,AAPL,11,2015,17,114.92,113.69,115.05,113.32,27616939,medium
2016-04-08,AAPL,4,2016,8,108.91,108.66,109.77,108.17,23581740,medium
2016-05-25,AAPL,5,2016,25,98.67,99.62,99.74,98.11,38642108,medium
2015-11-27,AAPL,11,2015,27,118.29,117.81,118.41,117.60,13046445,low
2016-08-03,AAPL,8,2016,3,104.81,105.79,105.84,104.77,30202641,medium

In [40]:
tech_df2.loc[(slice(None), ['AAPL','GOOGL']), ['high','low']]

                    high     low
date       name
2015-07-13 AAPL   125.76  124.32
2015-07-14 AAPL   126.37  125.04
2015-07-15 AAPL   127.15  125.58
2015-07-16 AAPL   128.57  127.35
2015-07-17 AAPL   129.62  128.31
...                  ...     ...
2016-08-11 GOOGL  813.88  806.00
2016-08-12 GOOGL  807.19  803.64
2016-08-15 GOOGL  811.36  804.03
2016-08-16 GOOGL  804.26  797.00
2016-08-17 GOOGL  805.63  796.30

[558 rows x 2 columns]